tutorials/incompressible/pUCoupledFoam/backwardFacingStepTurbulent/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Up
    {
        solver          AMG;
        cycle           W-cycle;
        coarseningType  SAMG;
        norm            twoNorm;
        normComponent   3;

        minGroupSize    2;
        maxGroupSize    4;

        nPreSweeps      2;
        nPostSweeps     2;
        groupSize       2;
        minCoarseEqns   4;
        nMaxLevels      100;
        scale           on;
        smoother
        {
            smoother    ILU;
            fillInLevel 1;
        }

        minIter         0;
        maxIter         100;
        tolerance       1e-7;
        relTol          0.001;
    }
    kEpsilon
    {
        solver           BiCGStab;
        preconditioner   Cholesky;
        tolerance        1e-07;
        relTol           0.1;

        minIter          1;
        maxIter          100;
    }

    // Segregated
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.01;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.01;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.01;
    }
}

blockSolver
{
    convergence 1e-6;
}

relaxationFactors
{
    U               0.95;
    k               0.9;
    epsilon         0.9;
}

fieldBounds
{
    U      500;
    p      -5e4 5e4;
}

SIMPLE
{
    nNonOrthoCorrectors 0;
}

// SIMPLE
// relaxationFactors
// {
//     p               0.3;
//     U               0.7;
//     k               0.7;
//     epsilon         0.7;
// }


// ************************************************************************* //
